#include <print>
#include "sjf.hpp"
#include "round_robin.hpp"
#include <concepts>


template<typename T>
void calc (T&& process) 
{
    if constexpr (std::same_as <T, SJF> || std::same_as<T, FCFS>)
    {
        calculateSJF(process);
    }
    if constexpr (std::same_as<T, RR>)
    {
        calculateRR(process);
    }
    if constexpr (std::same_as<T, SRTF>)
    {
        calculateSJF(process);
    }
};

int main()
{
    using std::println;
    /*
    1. Алгоритм «Первым пришел – первым обслужен» (First Come, First Served –
    FCFS)
    1. **Входные данные**: A(5), B(9), C(4), D(7). Найдите среднее время
    выполнения и время для каждого процесса.
    2. **Входные данные**: P1(6), P2(3), P3(8), P4(2). Найдите среднее время
    выполнения и время для каждого процесса.
    3. **Входные данные**: X(2), Y(6), Z(3), W(4). Найдите среднее время
    выполнения и время для каждого процесса.
    4. **Входные данные**: T1(10), T2(2), T3(4), T4(6). Найдите среднее время
    выполнения и время для каждого процесса.
    5. **Входные данные**: M(7), N(5), O(8), P(3). Найдите среднее время
    выполнения и время для каждого процесса.

    */
    std::println("FCFS\n{}", std::string(50, '='));
    calc(FCFS{ {"A", 5}, {"B", 9}, {"C", 4}, {"D",7 } });
    calc(FCFS{ {"P1", 6}, {"P2", 3}, {"P3",8}, {"P4",2} });
    calc(FCFS{ {"X",2}, {"Y", 6}, {"Z",3 }, {"W",4}});
    calc(FCFS{ {"T1",10}, {"T2", 2}, {"T3", 4}, {"T4", 6}});
    calc(FCFS{ {"M",7}, {"N",5 }, {"O",8}, {"P",3}});


    /*
        2. Алгоритм «Самый короткий процесс первым» (Shortest Job First – SJF)
        **Входные данные**: A(7), B(2), C(4), D(1)
        **Входные данные**: P1(5), P2(3), P3(1), P4(2)
        .
        **Входные данные**: X(6), Y(4), Z(3), W(2)
        **Входные данные**: T1(8), T2(3), T3(6), T4(1)
        **Входные данные**: M(9), N(5), O(2), P(4)
    *
    */

    std::println("SJF\n{}", std::string(50, '='));

    calc(SJF{ {"A", 7}, {"B", 2}, {"C", 4}, {"D", 1} });
    calc(SJF{ {"P1", 5}, {"P2", 3}, {"P3", 1}, {"P4", 2} });
    calc(SJF{ {"X", 6}, {"Y", 4}, {"Z", 3}, {"W", 2} });
    calc(SJF{ {"T1", 8}, {"T2", 3}, {"T3", 6}, {"T4", 1} });
    calc(SJF{ {"M", 9}, {"N", 5}, {"O", 2}, {"P", 4} });


    /*
    3. Алгоритм «Самое короткое оставшееся время» (Shortest Remaining Time First –
    SRTF)

    1. **Входные данные**: A(8), B(4), C(3), D(7). K = 5. Найдите среднее время
    выполнения и порядок выполнения процессов.
    2. **Входные данные**: P1(10), P2(5), P3(6), P4(8). K = 4. Найдите среднее время
    выполнения и порядок выполнения процессов.
    3. **Входные данные**: X(7), Y(9), Z(5), W(3). K = 3. Найдите среднее время
    выполнения и порядок выполнения процессов.
    4. **Входные данные**: T1(11), T2(6), T3(4), T4(8). K = 6. Найдите среднее время
    выполнения и порядок выполнения процессов.
    5. **Входные данные**: M(9), N(2), O(8), P(5). K = 4. Найдите среднее время
    выполнения и порядок выполнения процессов.
    *
    */

    std::println("SRTF\n{}", std::string(50, '='));
    calc(SRTF({ {"A",8}, {"B",4},{"C",3},{"D",7}, },5));
    calc(SRTF({ {"P1",10}, {"P2",5},{"P3",6},{"P4",8} },4));
    calc(SRTF({ {"X",7}, {"Y",9},{"Z",5},{"W",3} },3));
    calc(SRTF({ {"T1", 11}, {"T2",6},{"T3",4},{"T4",8} },6));
    calc(SRTF({ {"M",9}, {"N",2},{"O",8},{"P",5} },4));


    /*
    *
        4. Алгоритм «Round Robin» (Round Robin – RR)
        **Входные данные**: A(10), B(15), C(20), D(25). K = 10
        **Входные данные**: P1(12), P2(8), P3(16), P4(6). K = 7
        **Входные данные**: X(9), Y(14), Z(11), W(13). K = 5
        **Входные данные**: T1(20), T2(12), T3(9), T4(16). K = 8
        **Входные данные**: M(18), N(22), O(13), P(17). K = 9
    *
    */
    
    std::println("\nRound-Robin\n{}", std::string(50, '='));

    calc(RR{ { {"A", 10}, {"B", 15}, {"C", 20}, {"D", 25} }, 10 });
    calc(RR{ { {"P1", 12}, {"P2", 8}, {"P3", 16}, {"P4", 6} }, 7 });
    calc(RR{ { {"X", 9}, {"Y", 14}, {"Z", 11}, {"W", 13} }, 5 });
    calc(RR{ { {"T1", 20}, {"T2", 12}, {"T3", 9}, {"T4", 16} }, 8 });
    calc(RR{ { {"M", 18}, {"N", 22}, {"O", 13}, {"P", 17} }, 9 });


    /*
    5. Алгоритм «Планирование на основе приоритетов» (Priority Scheduling)
    1. **Входные данные**: A(5, 1), B(9, 3), C(6, 2), D(8, 4). Найдите среднее время
    выполнения и порядок выполнения процессов.
    2. **Входные данные**: P1(10, 2), P2(4, 1), P3(8, 3), P4(6, 4). Найдите среднее
    время выполнения и порядок выполнения процессов.
    3. **Входные данные**: X(12, 2), Y(7, 1), Z(5, 3), W(9, 4). Найдите среднее время
    выполнения и порядок выполнения процессов.
    4. **Входные данные**: T1(11, 3), T2(6, 1), T3(9, 2), T4(8, 4). Найдите среднее
    время выполнения и порядок выполнения процессов.
    5. **Входные данные**: M(13, 4), N(10, 3), O(7, 2), P(5, 1). Найдите среднее время
    выполнения и порядок выполнения процессов.
    *
    */

    std::println("\nPriority Scheduling {}", std::string(50, '='));


    /*
    6. Задачи для алгоритма «Самый короткий процесс следующий» (Временной
    квант K=8)
    1. **Входные данные**: 4 процесса со временем выполнения: A = 5, B = 12, C =
    7, D = 9. Найдите порядок выполнения и среднее время выполнения.
    2. **Входные данные**: 5 процессов со временем выполнения: A = 15, B = 3, C =
    8, D = 20, E = 4. Найдите порядок выполнения и среднее время выполнения.
    3. **Входные данные**: 4 процесса со временем выполнения: A = 10, B = 8, C =
    6, D = 2. Найдите порядок выполнения и среднее время выполнения.
    4. **Входные данные**: 3 процесса со временем выполнения: A = 6, B = 16, C =
    8. Найдите порядок выполнения и среднее время выполнения.
    5. **Входные данные**: 4 процесса со временем выполнения: A = 3, B = 9, C =
    14, D = 6. Найдите порядок выполнения и среднее время выполнения.
    7. Задачи для алгоритма «Планирование на основе справедливости» (Временной
    квант K=8)
    *
    */


    /*
    1. **Входные данные**: три пользователя. Первый пользователь получает 33%
    времени процессора и имеет процессы A(12), B(8). Второй пользователь получает 33%
    времени и имеет и процессы X(10), Y(6). Третий пользователь получает 33% времени и имеет
    процесс Z(16). Какой будет порядок выполнения процессов?
    2. **Входные данные**: Три пользователя. Первый пользователь получает 50%
    времени процессора и имеет процессы A(10), B(5). Второй пользователь получает 25%
    времени и имеет процессы X(7), Y(3). Третий пользователь получает 25% времени и имеет
    процесс Z(12). Какой будет порядок выполнения процессов?
    3. **Входные данные**: три пользователя. Первый пользователь получает 33%
    времени процессора и имеет процессы A(8), B(6), C(5). Второй пользователь получает 33%
    времени и имеет процессы X(12), Y(10). Третий пользователь получает 33% времени и имеет
    процесс Z(20). Какой будет порядок выполнения процессов?
    4. **Входные данные**: Четыре пользователя. Первый пользователь получает
    40% времени процессора и имеет процессы A(15), B(10), C(8). Второй пользователь получает
    20% времени и имеет процессы X(6), Y(5). Третий пользователь получает 20% времени и
    имеет процесс Z(18). Четвертый пользователь получает 20% времени и имеет процесс Q(14).
    Какой будет порядок выполнения процессов?
    5. **Входные данные**: Три пользователя. Первый пользователь получает 50%
    времени процессора и имеет процессы A(10), B(7), C(6). Второй пользователь получает 25%
    времени и имеет процесс X(10). Третий пользователь получает 25% времени и имеет процесс
    Z(14). Какой будет порядок выполнения процессов?
    */
};
